using System;

namespace Co.Kaiba.Blueeyes.Dimensionstory.ModdingPlatform.Weather
{
    [Flags]
    public enum AMapWeather
    {
        晴天 = 1 << 0,
        多云 = 1 << 1,
        阴 = 1 << 2,
        阵雨 = 1 << 3,
        雷阵雨 = 1 << 4,
        雷阵雨并伴有冰雹 = 1 << 5,
        雨夹雪 = 1 << 6,
        小雨 = 1 << 7,
        中雨 = 1 << 8,
        大雨 = 1 << 9,
        暴雨 = 1 << 10,
        大暴雨 = 1 << 11,
        特大暴雨 = 1 << 12,
        阵雪 = 1 << 13,
        小雪 = 1 << 14,
        中雪 = 1 << 15,
        大雪 = 1 << 16,
        暴雪 = 1 << 17,
        雾 = 1 << 18,
        冻雨 = 1 << 19,
        沙尘暴 = 1 << 20,
        小雨_中雨 = 1 << 21,
        中雨_大雨 = 1 << 22,
        大雨_暴雨 = 1 << 23,
        暴雨_大暴雨 = 1 << 24,
        大暴雨_特大暴雨 = 1 << 25,
        小雪_中雪 = 1 << 26,
        中雪_大雪 = 1 << 27,
        大雪_暴雪 = 1 << 28,
        浮尘 = 1 << 29,
        扬沙 = 1 << 30,
    }

    [Flags]
    public enum AMapWeather0
    {
        强沙尘暴 = 1 << 0,
        飑 = 1 << 1,
        龙卷风 = 1 << 2,
        弱高吹雪 = 1 << 3,
        轻雾 = 1 << 4,
        霾 = 1 << 5
    }
}
